{
  "kind": "build_request",
  "title": "Fix end-to-end functionality: form submission, creative generation, save/load flow",
  "projectName": "UGC Creative Director",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Audit and fix the creative package generation flow so that submitting the multi-step form correctly invokes `generateCreativePackage` from `creativeGenerator.ts`, passes all form inputs (product name, description, platforms, funnel stage, tone mode, competitor info), and transitions the app view from 'form' to 'results' with the generated package displayed in `CreativeResults`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it working"
        ]
      },
      "acceptanceCriteria": [
        "Filling in the multi-step form and clicking Submit triggers `generateCreativePackage` with the correct inputs",
        "The app navigates to the results view after submission",
        "The results view renders all generated sections (persona, hooks, scripts, Meta Ads, Google Ads, shot breakdown)",
        "No console errors occur during the form-to-results flow"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Audit and fix the backend save and history flow in `useQueries.ts` so that the 'Save Package' action in `CreativeResults` correctly calls the backend actor's save function, and `PackageHistory` correctly fetches and lists all previously saved packages using the actor's list/query functions.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it working"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Save Package' in the results view sends the package to the backend and shows a success confirmation",
        "The History view lists all previously saved packages fetched from the backend",
        "Selecting a package from history navigates to the results view and displays that package's content",
        "Loading and error states are handled gracefully in `PackageHistory`"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Audit and fix the navigation flow in `App.tsx` so that the 'New Creative' button resets the app to the form view, the 'History' button navigates to the history view, and back/cancel actions from results or history return to the form view without losing state unexpectedly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it working"
        ]
      },
      "acceptanceCriteria": [
        "'New Creative' button resets the form and navigates to the form view",
        "'History' button navigates to the PackageHistory view",
        "Navigating back from results or history returns to the correct prior view",
        "No blank or broken screens appear during navigation transitions"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Audit and fix the 'Copy to Clipboard' and 'Copy All' buttons in `CreativeResults` so they correctly copy the content of each individual section or the full package text to the clipboard and display a visible confirmation (e.g., button label change or toast) after copying.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it working"
        ]
      },
      "acceptanceCriteria": [
        "Each section's 'Copy' button copies only that section's text to the clipboard",
        "'Copy All' button copies the entire generated package as formatted text",
        "A visible confirmation (label change, icon, or toast) appears after a successful copy",
        "Copy functionality works in all major modern browsers"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure the Motoko backend actor in `backend/main.mo` correctly compiles and exposes all required update and query functions: saving a creative package (with all fields including scripts, ad copy, persona, shot breakdown), retrieving a package by ID, and listing all saved packages. Fix any type mismatches or missing field definitions that prevent successful canister deployment.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make it working"
        ]
      },
      "acceptanceCriteria": [
        "The backend actor compiles without errors",
        "savePackage update function accepts a full CreativePackage record and returns the new ID",
        "getPackage query function returns the correct package for a given ID",
        "listPackages query function returns all saved packages",
        "Frontend actor calls in useQueries.ts resolve without type errors"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Keep all backend logic in backend/main.mo as a single actor",
    "Do not introduce new external dependencies or libraries"
  ],
  "nonGoals": [
    "Adding new creative generation features or new output sections",
    "Changing the visual design or theme",
    "Adding authentication beyond what is already wired via useInternetIdentity",
    "Real-time or WebSocket-based updates"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}